# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

N =int(input("Введите число для перевода в двоичный формат: "))
binary_N = bin(N)
print(binary_N)